hwchaos/BETTA-HA-PANEL-ESP32-P4-WIFI6-Touch-LCD-4.3/sdkconfig.defaults.panel4
# SPDX-License-Identifier: LicenseRef-FNCL-1.1
# Copyright (c) 2026 Cpt_Kirk
#
# Panel variant overlay: 4" 720x720 (original smart86 hardware).
# Apply together with the common sdkconfig.defaults via
#   idf.py -D SDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.panel4" ...
# or the CMake preset "panel4" (see CMakePresets.json).

# --- SoC target ---
CONFIG_IDF_TARGET="esp32p4"

CONFIG_APP_PANEL_VARIANT_4INCH_720=y
# CONFIG_APP_PANEL_VARIANT_10INCH_1280 is not set

# --- BSP display/touch: Waveshare ESP32-P4-WIFI6-Touch-LCD-4B (800x800 3.4") ---
CONFIG_BSP_LCD_TYPE_800_800_3_4_INCH=y
CONFIG_ESP_LCD_TOUCH_MAX_POINTS=5
CONFIG_LV_USE_LODEPNG=y
